import streamlit as st

st.title("Мини тест – География и История")
st.write("Отговори на въпросите и натисни „Провери резултата“")

q1 = st.radio(
    "1. Коя е столицата на България?",
    ("Пловдив", "София", "Варна")
)

q2 = st.number_input(
    "2. Колко континента има на Земята?",
    min_value=1,
    max_value=10,
    step=1
)

q3 = st.radio(
    "3. Кой е първият български цар?",
    ("Цар Симеон", "Хан Аспарух", "Цар Иван Асен II")
)

q4 = st.radio(
    "4. През коя година България влиза в ЕС?",
    ("2001", "2007", "2010")
)

q5 = st.text_input("5. Как се казва най-дългата река в България?")

if st.button("Провери резултата"):
    points = 0

    if q1 == "София":
        points += 1
    if q2 == 7:
        points += 1
    if q3 == "Хан Аспарух":
        points += 1
    if q4 == "2007":
        points += 1
    if q5 and q5.strip().lower() == "искър":
        points += 1

    st.write(f"Твоят резултат: {points} / 5")

    if points >= 4:
        st.success("Браво! Отличен резултат 🎉")
    elif points >= 2:
        st.warning("Добре, но можеш и по-добре 🙂")
    else:
        st.error("Опитай пак! 😅")

